#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//1.
//写一个函数返回参数二进制中 1 的个数
//比如： 15       0000 1111       4 个 1
//程序原型：
//int  count_one_bits(unsigned int value)
//{
//    // 返回 1的位数
//}

//int count_one_bits(unsigned int value)
//{
//    int count = 0;
//    for (int i = 0; i < 32; i++)
//    {
//        /*if (value & (1 << i))
//        {
//            count++;
//        }*/
//        if ((value >> i) & 1)
//        {
//            count++;
//        }
//    }
//    return count;
//    // 返回 1的位数
//}
//
//int main()
//{
//    unsigned int num = 0;
//    //num=-1
//    //原码：10000000000000000000000000000001
//    //反码：11111111111111111111111111111110
//    //补码：11111111111111111111111111111111   32个1
//
//    //num=-2
//    //原码：10000000000000000000000000000010
//    //反码：11111111111111111111111111111101
//    //补码：11111111111111111111111111111110   31个1
//
//    //-1&-1
//    //补码：11111111111111111111111111111111   32个1
//    //补码：11111111111111111111111111111110   31个1
//    //=>    11111111111111111111111111111110 
//    int count = 0;
//    scanf("%d", &num);
//    count = count_one_bits(num);
//    printf("%d二进制中 1 的个数为：%d\n", num, count);
//    return 0;
//}


//2.获取一个数二进制序列中所有的偶数位和奇数位，
//分别输出二进制序列。
// 
//void print(int num,int x)
//{
//	for (int i = 0; i < 16; i++)
//	{
//		if (num & (1 << (2 * i + x)))//奇/偶数位
//		{
//			printf("%d ", 1);
//		}
//		else
//		{
//			printf("%d ", 0);
//		}
//	}
//}
//
//int main()
//{
//	int num = 0;
//	scanf("%d", &num);
//
//
//	//for (int i = 0; i < 16; i++)
//	//{
//	//	if (num & (1 << 2 * i))//奇数位
//	//	{
//	//		printf("%d ", 1);
//	//	}
//	//	else
//	//	{
//	//		printf("%d ", 0);
//	//	}
//	//}
//	//printf("\n");
//	//for (int i = 0; i < 16; i++)
//	//{
//	//	if (num & (1 << (2 * i + 1)))//偶数位
//	//	{
//	//		printf("%d ", 1);
//	//	}
//	//	else
//	//	{
//	//		printf("%d ", 0);
//	//	}
//	//}
//
//
//	printf("奇数位：");
//	print(num, 0);
//	printf("\n偶数位：");
//	print(num, 1);
//	return 0;
//}


//3. 输出一个整数的每一位二进制位。

//void OutPut(int num)
//{
//	for (int i = 31; i >= 0; i--)
//	{
//		printf("%d ", (num >> i) & 1);
//	}
//	
//}
//
//int main()
//{
//	int num = 0;
//	//num=15
//	//00000000000000000000000000001111
//	scanf("%d", &num);
//	//int sz = sizeof(num) * 8;
//	printf("二进制位为：");
//	OutPut(num);
//	return 0;
//}


//4.编程实现：
//两个int（32位）整数m和n的二进制表达中，
//有多少个位(bit)不同？
//输入例子 :
//1999 2299
// 1999：0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 0 0 1 1 1 1
// 2299：0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 1 1 1 1 1 0 1 1
//输出例子 : 7

int main()
{
	int x = 0;
	int y = 0;
	int count = 0;
	scanf("%d %d", &x, &y);
	for (int i = 0; i < 32; i++)
	{
		if ((((x >> i)&1) ^ ((y >> i)&1)))
		{
			count++;
		}
	}
	printf("有%d个位(bit)不同", count);
}